{
    "events": [
      {
        "media": {
          "url": "/images/verigen.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "07",
          "day": "01"
        },
        "text": {
          "headline": "VeriGen",
          "text": "<p>The Verilog Code Generation project represents a significant stride in the application of AI in the workplace, particularly for generating Verilog code for chip design Especially for the 16-bit CNN module consisting of 16-bit adder and multiplier. By integrating the GPT 3.5 Turbo model in Azure Open AI for contextually relevant responses, the chatbot is designed to Verilog code generation. This is helpful to the chip designer and verification engineers to design and verify the chip by using Verilog and deploying it to a web app.</p>"
        }
      },
      {
        "media": {
          "url": "/images/prompt.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "01",
          "day": "01"
        },
        "text": {
          "headline": "Prompt Engineering",
          "text": "<p>Unlock the full potential of AI with expert prompt engineering. Our approach ensures precision, efficiency, and optimal results, allowing you to maximize the impact of your AI solutions.</p>"
        }
      },
      {
        "media": {
          "url": "/images/LLM.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "02",
          "day": "01"
        },
        "text": {
          "headline": "LLM Architecture",
          "text": "<p>Discover the forefront of AI innovation with advanced LLM architecture, designed to drive the future of intelligent systems. Experience the power and precision that sets the standard for tomorrow's technology.</p>"
        }
      },
      {
        "media": {
          "url": "/images/Text.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "03",
          "day": "01"
        },
        "text": {
          "headline": "Text generation",
          "text": "<p>Effortlessly unleash your creativity with AI-powered text generation. Instantly craft compelling content tailored to your needs, all in a matter of seconds.</p>"
        }
      },
      {
        "media": {
          "url": "/images/RAG.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "04",
          "day": "01"
        },
        "text": {
          "headline": "Retrieval Augmented Generation",
          "text": "<p>Retrieval-Augmented Generation (RAG) combines the power of AI with real-time data retrieval, enabling models to generate highly accurate and context-aware content. By seamlessly integrating up-to-date information from vast knowledge sources, RAG enhances the precision and relevance of AI-generated outputs, making it ideal for tasks requiring deep knowledge and dynamic responses.</p>"
        }
      },
      {
        "media": {
          "url": "/images/stream.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "04",
          "day": "17"
        },
        "text": {
          "headline": "Streaming",
          "text": "<p>Experience seamless content delivery with our text streaming technology. Instantly stream text-based content in real-time, ensuring your audience stays engaged with uninterrupted, dynamic updates tailored to their needs.</p>"
        }
      },
      {
        "media": {
          "url": "/images/agent.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "04",
          "day": "22"
        },
        "text": {
          "headline": "AI Agents",
          "text": "<p>AI agents built on large language models control the path to solving a complex problem. They can typically act on feedback to refine their plan of action, a capability that can improve performance and help them accomplish more sophisticated tasks.</p>"
        }
      },
      {
        "media": {
          "url": "/images/image.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "05",
          "day": "01"
        },
        "text": {
          "headline": "Image generation",
          "text": "<p>AI-driven image generation empowers you to bring your creative vision to life with unparalleled speed and precision. Whether you're an artist, designer, or innovator, our technology enables you to produce stunning visuals effortlessly, blending artistry with advanced AI to accelerate your creative process.</p>"
        }
      },
      {
        "media": {
          "url": "/images/audio.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "07",
          "day": "01"
        },
        "text": {
          "headline": "Audio generation",
          "text": "<p>Compose the Future with AI-Powered Audio Generation. Our innovative technology allows you to create personalized music effortlessly, blending your unique sound with cutting-edge AI to bring your musical vision to life.</p>"
        }
      },
      {
        "media": {
          "url": "/images/events.jpeg",
          "credit": "Generated image from ideogram"
        },
        "start_date": {
          "year": "2024",
          "month": "07",
          "day": "01"
        },
        "text": {
          "headline": "Events",
          "text": "<p>We are actively participating in events to enhance our innovative ideas, refine our skills, and explore real-life use cases in generative AI. These experiences are driving us to push the boundaries of what's possible and apply cutting-edge technology to solve real-world challenges.</p>"
        }
      }
    ]
  }
  