{
  "title": {
    "media": {
      "url": "/images/verigen.jpeg",
      "credit": "Generated image from stable diffusion"
    },
    "text": {
      "headline": "VeriGen",
      "text": "<p>The Verilog Code Generation project represents a significant stride in the application of AI in the workplace, particularly for generating Verilog code for chip design Especially for the 16-bit CNN module consisting of 16-bit adder and multiplier. By integrating the GPT 3.5 Turbo model in Azure Open AI for contextually relevant responses, the chatbot is designed to Verilog code generation. This is helpful to the chip designer and verification engineers to design and verify the chip by using Verilog and deploying it to a web app.</p>"
    }
  },
    "events": [
      {
        "media": {
          "url": "/images/frame.png",
          "credit": "image from google"
        },
        "start_date": {
          "year": "2024",
          "month": "01",
          "day": "02"
        },
        "text": {
          "headline": "Frameworks",
          "text": "<p>There are three primary frameworks used for loading AI models: Ollama, LM Studio, and Azure AI Studio. These platforms provide robust tools and environments to efficiently manage, deploy, and optimize AI models, catering to diverse development needs and ensuring seamless integration into your projects</p>"
        }
      },
      {
        "media": {
          "url": "/images/azure.png",
          "credit": "image from google"
        },
        "start_date": {
          "year": "2024",
          "month": "03",
          "day": "21"
        },
        "text": {
          "headline": "Verilog code generation",
          "text": "<p>Verilog code generation is seamlessly achieved using GPT-3.5 via Azure AI Studio's API, providing efficient and accurate hardware description language scripts tailored to your design needs.</p>"
        }
      },
      {
        "media": {
          "url": "/images/open.png",
          "credit": "image from google"
        },
        "start_date": {
          "year": "2024",
          "month": "05",
          "day": "8"
        },
        "text": {
          "headline": "Openlane Integration",
          "text": "<p>Integrate the open-source tool OpenLane to seamlessly verify generated Verilog code and testbenches. Automate the verification process for enhanced efficiency and accuracy in your chip design workflow. </p>"
        }
      }
    ]
}
